# Data Merging

In [5]:
import pandas as pd

In [9]:
# Create dataset
data1 = {
    'id': [1, 2, 3],
    'name': ['Ahmed', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}
df1 = pd.DataFrame(data1)
df1.head()

   id    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [13]:
# Create dataset
data2 = {
    'id': [1, 2, 3],
    'city': ['Karachi', 'Lahore', 'Islamabad'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}
df2 = pd.DataFrame(data2)
df2.head()

   id       city occupation
0   1    Karachi   Engineer
1   2     Lahore     Doctor
2   3  Islamabad    Teacher

In [14]:
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df

   id    name  age       city occupation
0   1   Ahmed   28    Karachi   Engineer
1   2  Fatima   32     Lahore     Doctor
2   3     Ali   24  Islamabad    Teacher

# Data Concatenation

In [17]:
import pandas as pd

In [15]:
data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'age': [28, 32, 24]}
data2 = {'Name': ['Sara', 'Usman', 'Nisha'], 'age': [29, 35, 27]}
data3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'Punjab']}

In [16]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [18]:
concatenated_rows = pd.concat([df1, df2])
concatenated_rows

     Name  age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Nisha   27

In [19]:
concatenated_columns = pd.concat([df1, df3
                                  
                                  ], axis=1)
concatenated_columns

     Name  age       City Province
0   Ahmed   28    Karachi    Sindh
1  Fatima   32     Lahore   Punjab
2     Ali   24  Islamabad   Punjab